app/views/homes/show.html.erb

String @country = Net::HTTP.get(uri).scan(/<country>(.*)<\/country>/).to_s[12...-6]
Visit.create  country: @country, visited_at: DateTime.now+1, load_time: 1
---
INSERT INTO "visits" ("country", "visited_at", "load_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"