app/controllers/homes_controller.rb

  def show
    @visits = Visit.all
---
SELECT "visits".* FROM "visits"